# String Search
- functions depend upon whether it works on series or frame

In [2]:
import pandas as pd

In [3]:
# Create a DataFrame
data = {"Name": ["John", "Jane", "Mary", "Adam"],   "City": ["New York", "Los Angeles", "Chicago", "Houston"]}
df = pd.DataFrame(data)
df

   Name         City
0  John     New York
1  Jane  Los Angeles
2  Mary      Chicago
3  Adam      Houston

In [4]:
# Filter the DataFrame by a string value in the "City" column
filtered_df = df[df["City"].str.contains("Los Angeles")]
print(filtered_df)

   Name         City
1  Jane  Los Angeles

In [7]:
#multiple Strings
df[df["City"].str.contains("Los Angeles|Chicago")]

   Name         City
1  Jane  Los Angeles
2  Mary      Chicago

In [6]:
df[df["City"].str.contains("Los|Chic")]

   Name         City
1  Jane  Los Angeles
2  Mary      Chicago

In [8]:
# Filter the DataFrame by a list of string values in the "City" column
df[df["City"].isin(["Los Angeles", "Chicago"])]

   Name         City
1  Jane  Los Angeles
2  Mary      Chicago

In [9]:
df[df["City"].isin(["Los", "ago"])]  #part does not work

Empty DataFrame
Columns: [Name, City]
Index: []

In [10]:
mylist = ['Los Angeles', 'Chicago']
pattern = '|'.join(mylist)
print(pattern)

Los Angeles|Chicago

In [21]:
df[df["City"].isin(mylist)]

   Name         City
1  Jane  Los Angeles
2  Mary      Chicago

In [23]:
df[df.City.str.contains(pattern)]

   Name         City
1  Jane  Los Angeles
2  Mary      Chicago

In [17]:
mylist2 = ['Los', 'ago']
pattern2 = '|'.join(mylist2)
print(pattern2)

Los|ago

In [18]:
df[df.City.str.contains(pattern2)]
#series

   Name         City
1  Jane  Los Angeles
2  Mary      Chicago

In [36]:
df[df.City.str.lower().isin(x.lower() for x in mylist)]

   Name         City
1  Jane  Los Angeles
2  Mary      Chicago

NameError: name 'to_lower' is not defined